INSERT INTO subject_exam_rooms (subject_exam_id, rooms_name)
VALUES
    -- 02.09.2024
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-ДМ-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-НВД-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-НВД-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-НП-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-НП-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-ВБС-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ВБС-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ВБС-СЕПТЕМВРИ', 'Лаб. 215'),

    ('2024-ОР-СЕПТЕМВРИ', '117'),
    ('2024-ОР-СЕПТЕМВРИ', '315'),

    ('2024-ДОС-СЕПТЕМВРИ', '117'),

    ('2024-КАЛК1-СЕПТЕМВРИ', 'Електро/Машински'),


    -- 03.09.2024
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-ИПКС-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-ВНП-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-ДС1-СЕПТЕМВРИ', 'Б2.2'),
    ('2024-ДС1-СЕПТЕМВРИ', 'Б3.2'),

    ('2024-МУЛТСМИ-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-МУЛТСМИ-СЕПТЕМВРИ', 'Лаб. 200а'),

    ('2024-МАТ1-СЕПТЕМВРИ', '117'),
    ('2024-МАТ1-СЕПТЕМВРИ', '315'),
    ('2024-МАТ1-СЕПТЕМВРИ', 'Б1'),
    ('2024-МАТ1-СЕПТЕМВРИ', 'Б2.2'),
    ('2024-МАТ1-СЕПТЕМВРИ', 'Б3.2'),
    ('2024-МАТ1-СЕПТЕМВРИ', 'Електро/Машински'),

    -- 04.09.2024
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб.2'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 3'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 12'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 200а'),
    ('2024-ВКОМПН-СЕПТЕМВРИ', 'Лаб. 200ц'),

    ('2024-ВИС-СЕПТЕМВРИ', '117'),
    ('2024-ВИС-СЕПТЕМВРИ', '315'),
    ('2024-ВИС-СЕПТЕМВРИ', 'Б1'),
    ('2024-ВИС-СЕПТЕМВРИ', 'Б2.2'),
    ('2024-ВИС-СЕПТЕМВРИ', 'Б3.2'),
    ('2024-ВИС-СЕПТЕМВРИ', 'Електро/Машински'),

    ('2024-СВС-СЕПТЕМВРИ', 'Лаб. 215'),

    ('2024-НИЧК-СЕПТЕМВРИ', 'Лаб. 200а'),

    ('2024-ПР-СЕПТЕМВРИ', 'Лаб. 200а'),

    ('2024-ДИАС-СЕПТЕМВРИ', 'Лаб. 13'),
    ('2024-ДИАС-СЕПТЕМВРИ', 'Лаб. 138'),
    ('2024-ДИАС-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ДИАС-СЕПТЕМВРИ', 'Лаб. 200а');



INSERT INTO subject_exam_rooms (subject_exam_id, rooms_name)
VALUES
    -- 05.09.2024
    ('2024-СОФТИНЖ-СЕПТЕМВРИ', '117'),
    ('2024-СОФТИНЖ-СЕПТЕМВРИ', '315'),
    ('2024-СОФТИНЖ-СЕПТЕМВРИ', 'Б1'),
    ('2024-СОФТИНЖ-СЕПТЕМВРИ', 'Б2.2'),
    ('2024-СОФТИНЖ-СЕПТЕМВРИ', 'Б3.2'),

    ('2024-ДИЧК-СЕПТЕМВРИ', 'Лаб. 215'),
    ('2024-ДИЧК-СЕПТЕМВРИ', 'Лаб. 138'),

    ('2024-BIZSTAT-SEPTEMBER', 'Лаб. 3'),

    ('2024-ДИГБИБ-СЕПТЕМВРИ', '117'),
    ('2024-ДИГБИБ-СЕПТЕМВРИ', '315'),
    ('2024-ДИГБИБ-СЕПТЕМВРИ', 'Б1'),
    ('2024-ДИГБИБ-СЕПТЕМВРИ', 'Б2.2'),
    ('2024-ДИГБИБ-СЕПТЕМВРИ', 'Б3.2'),

    ('2024-ВИРТ-СЕПТЕМВРИ', 'Лаб. 13');


INSERT INTO subject_exam_rooms (subject_exam_id, rooms_name)
VALUES
    ('2024-BIZSTAT-SEPTEMBER', 'Лаб. 3');