INSERT INTO year_exam_session (name, session, year, session_start, session_end, enrollment_start_date, enrollment_end_date)
VALUES
    ('2024 Август-Септемвриска испитна сесија', 'SEPTEMBER', '2024', '2024-08-26', '2024-09-17', '2024-08-26', '2024-09-17'),
    ('2024 (Летна) Втора испитна сесија', 'JUNE', '2024', '2024-05-26', '2024-06-17', '2024-05-26', '2024-06-17'),
    ('2024 (Зимска) Прва испитна сесија', 'JANUARY', '2024', '2024-01-01', '2024-01-31', '2024-01-01', '2024-01-31');


INSERT INTO year_exam_session_cycle (year_exam_session_name, cycle)
VALUES
    ('2024 Август-Септемвриска испитна сесија', 'UNDERGRADUATE'),
    ('2024 (Летна) Втора испитна сесија', 'UNDERGRADUATE'),
    ('2024 (Зимска) Прва испитна сесија', 'UNDERGRADUATE'),

    ('2024 Август-Септемвриска испитна сесија', 'MASTER'),
    ('2024 (Летна) Втора испитна сесија', 'MASTER'),
    ('2024 (Зимска) Прва испитна сесија', 'MASTER'),

    ('2024 Август-Септемвриска испитна сесија', 'PHD'),
    ('2024 (Летна) Втора испитна сесија', 'PHD'),
    ('2024 (Зимска) Прва испитна сесија', 'PHD');
